Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/eth.h
#define ETH_TN_TNS_Pos                        _UINT32_(0)                                          /* (ETH_TN) Timer Count in Nanoseconds Position */
#define ETH_TN_TNS_Msk                        (_UINT32_(0x3FFFFFFF) << ETH_TN_TNS_Pos)             /* (ETH_TN) Timer Count in Nanoseconds Mask */
#define ETH_TN_TNS(value)                     (ETH_TN_TNS_Msk & (_UINT32_(value) << ETH_TN_TNS_Pos)) /* Assigment of value for TNS in the ETH_TN register */
#define ETH_TN_Msk                            _UINT32_(0x3FFFFFFF)                                 /* (ETH_TN) Register Mask  */


/* -------- ETH_TA : (ETH Offset: 0x11D8) (R/W 32) 1588 Timer Adjust Register -------- */
#define ETH_TA_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TA) 1588 Timer Adjust Register  Reset Value */

#define ETH_TA_ITDT_Pos                       _UINT32_(0)                                          /* (ETH_TA) Increment/Decrement Position */
#define ETH_TA_ITDT_Msk                       (_UINT32_(0x3FFFFFFF) << ETH_TA_ITDT_Pos)            /* (ETH_TA) Increment/Decrement Mask */
#define ETH_TA_ITDT(value)                    (ETH_TA_ITDT_Msk & (_UINT32_(value) << ETH_TA_ITDT_Pos)) /* Assigment of value for ITDT in the ETH_TA register */
#define ETH_TA_ADJ_Pos                        _UINT32_(31)                                         /* (ETH_TA) Adjust 1588 Timer Position */
#define ETH_TA_ADJ_Msk                        (_UINT32_(0x1) << ETH_TA_ADJ_Pos)                    /* (ETH_TA) Adjust 1588 Timer Mask */
#define ETH_TA_ADJ(value)                     (ETH_TA_ADJ_Msk & (_UINT32_(value) << ETH_TA_ADJ_Pos)) /* Assigment of value for ADJ in the ETH_TA register */
#define ETH_TA_Msk                            _UINT32_(0xBFFFFFFF)                                 /* (ETH_TA) Register Mask  */


/* -------- ETH_TI : (ETH Offset: 0x11DC) (R/W 32) 1588 Timer Increment Register -------- */
#define ETH_TI_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TI) 1588 Timer Increment Register  Reset Value */

#define ETH_TI_CNS_Pos                        _UINT32_(0)                                          /* (ETH_TI) Count Nanoseconds Position */
#define ETH_TI_CNS_Msk                        (_UINT32_(0xFF) << ETH_TI_CNS_Pos)                   /* (ETH_TI) Count Nanoseconds Mask */
#define ETH_TI_CNS(value)                     (ETH_TI_CNS_Msk & (_UINT32_(value) << ETH_TI_CNS_Pos)) /* Assigment of value for CNS in the ETH_TI register */
#define ETH_TI_ACNS_Pos                       _UINT32_(8)                                          /* (ETH_TI) Alternative Count Nanoseconds Position */
#define ETH_TI_ACNS_Msk                       (_UINT32_(0xFF) << ETH_TI_ACNS_Pos)                  /* (ETH_TI) Alternative Count Nanoseconds Mask */
#define ETH_TI_ACNS(value)                    (ETH_TI_ACNS_Msk & (_UINT32_(value) << ETH_TI_ACNS_Pos)) /* Assigment of value for ACNS in the ETH_TI register */
#define ETH_TI_NIT_Pos                        _UINT32_(16)                                         /* (ETH_TI) Number of Increments Position */
#define ETH_TI_NIT_Msk                        (_UINT32_(0xFF) << ETH_TI_NIT_Pos)                   /* (ETH_TI) Number of Increments Mask */
#define ETH_TI_NIT(value)                     (ETH_TI_NIT_Msk & (_UINT32_(value) << ETH_TI_NIT_Pos)) /* Assigment of value for NIT in the ETH_TI register */
#define ETH_TI_Msk                            _UINT32_(0x00FFFFFF)                                 /* (ETH_TI) Register Mask  */


/* -------- ETH_EFTSL : (ETH Offset: 0x11E0) ( R/ 32) PTP Event Frame Transmitted Seconds Low Register -------- */
#define ETH_EFTSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFTSL) PTP Event Frame Transmitted Seconds Low Register  Reset Value */

#define ETH_EFTSL_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFTSL) Register Update Position */
#define ETH_EFTSL_RUD_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_EFTSL_RUD_Pos)          /* (ETH_EFTSL) Register Update Mask */
#define ETH_EFTSL_RUD(value)                  (ETH_EFTSL_RUD_Msk & (_UINT32_(value) << ETH_EFTSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTSL register */
#define ETH_EFTSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_EFTSL) Register Mask  */


/* -------- ETH_EFTN : (ETH Offset: 0x11E4) ( R/ 32) PTP Event Frame Transmitted Nanoseconds -------- */
#define ETH_EFTN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_EFTN) PTP Event Frame Transmitted Nanoseconds  Reset Value */

#define ETH_EFTN_RUD_Pos                      _UINT32_(0)                                          /* (ETH_EFTN) Register Update Position */
#define ETH_EFTN_RUD_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_EFTN_RUD_Pos)           /* (ETH_EFTN) Register Update Mask */
#define ETH_EFTN_RUD(value)                   (ETH_EFTN_RUD_Msk & (_UINT32_(value) << ETH_EFTN_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFTN register */
#define ETH_EFTN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_EFTN) Register Mask  */


/* -------- ETH_EFRSL : (ETH Offset: 0x11E8) ( R/ 32) PTP Event Frame Received Seconds Low Register -------- */
#define ETH_EFRSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_EFRSL) PTP Event Frame Received Seconds Low Register  Reset Value */

#define ETH_EFRSL_RUD_Pos                     _UINT32_(0)                                          /* (ETH_EFRSL) Register Update Position */
#define ETH_EFRSL_RUD_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_EFRSL_RUD_Pos)          /* (ETH_EFRSL) Register Update Mask */
#define ETH_EFRSL_RUD(value)                  (ETH_EFRSL_RUD_Msk & (_UINT32_(value) << ETH_EFRSL_RUD_Pos)) /* Assigment of value for RUD in the ETH_EFRSL register */
#define ETH_EFRSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_EFRSL) Register Mask  */


/* -------- ETH_EFRN : (ETH Offset: 0x11EC) ( R/ 32) PTP Event Frame Received Nanoseconds -------- */
#define ETH_EFRN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_EFRN) PTP Event Frame Received Nanoseconds  Reset Value */

