Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/eth.h
/* -------- ETH_RBQSZ : (ETH Offset: 0x14A0) (R/W 32) Receive Priority Queue Buffer Size -------- */
#define ETH_RBQSZ_RESETVALUE                  _UINT32_(0x02)                                       /*  (ETH_RBQSZ) Receive Priority Queue Buffer Size  Reset Value */

#define ETH_RBQSZ_RXBUFSZ_Pos                 _UINT32_(0)                                          /* (ETH_RBQSZ) DMA Receive Buffer Size Position */
#define ETH_RBQSZ_RXBUFSZ_Msk                 (_UINT32_(0xFF) << ETH_RBQSZ_RXBUFSZ_Pos)            /* (ETH_RBQSZ) DMA Receive Buffer Size Mask */
#define ETH_RBQSZ_RXBUFSZ(value)              (ETH_RBQSZ_RXBUFSZ_Msk & (_UINT32_(value) << ETH_RBQSZ_RXBUFSZ_Pos)) /* Assigment of value for RXBUFSZ in the ETH_RBQSZ register */
#define ETH_RBQSZ_Msk                         _UINT32_(0x000000FF)                                 /* (ETH_RBQSZ) Register Mask  */


/* -------- ETH_CBSCTRL : (ETH Offset: 0x14BC) (R/W 32) CBS Control Register -------- */
#define ETH_CBSCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_CBSCTRL) CBS Control Register  Reset Value */

#define ETH_CBSCTRL_CBSEQA_Pos                _UINT32_(0)                                          /* (ETH_CBSCTRL) Enable Credit-Based shaping on the highest priority queue (queue A) Position */
#define ETH_CBSCTRL_CBSEQA_Msk                (_UINT32_(0x1) << ETH_CBSCTRL_CBSEQA_Pos)            /* (ETH_CBSCTRL) Enable Credit-Based shaping on the highest priority queue (queue A) Mask */
#define ETH_CBSCTRL_CBSEQA(value)             (ETH_CBSCTRL_CBSEQA_Msk & (_UINT32_(value) << ETH_CBSCTRL_CBSEQA_Pos)) /* Assigment of value for CBSEQA in the ETH_CBSCTRL register */
#define ETH_CBSCTRL_CBSEQB_Pos                _UINT32_(1)                                          /* (ETH_CBSCTRL) Enable Credit-Based shaping on the 2nd highest priority queue (queue B) Position */
#define ETH_CBSCTRL_CBSEQB_Msk                (_UINT32_(0x1) << ETH_CBSCTRL_CBSEQB_Pos)            /* (ETH_CBSCTRL) Enable Credit-Based shaping on the 2nd highest priority queue (queue B) Mask */
#define ETH_CBSCTRL_CBSEQB(value)             (ETH_CBSCTRL_CBSEQB_Msk & (_UINT32_(value) << ETH_CBSCTRL_CBSEQB_Pos)) /* Assigment of value for CBSEQB in the ETH_CBSCTRL register */
#define ETH_CBSCTRL_Msk                       _UINT32_(0x00000003)                                 /* (ETH_CBSCTRL) Register Mask  */


/* -------- ETH_CBSISQA : (ETH Offset: 0x14C0) (R/W 32) IdleSlope value for queue A -------- */
#define ETH_CBSISQA_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_CBSISQA) IdleSlope value for queue A  Reset Value */

#define ETH_CBSISQA_ISA_Pos                   _UINT32_(0)                                          /* (ETH_CBSISQA) IdleSlope value for queue A Position */
#define ETH_CBSISQA_ISA_Msk                   (_UINT32_(0xFFFFFFFF) << ETH_CBSISQA_ISA_Pos)        /* (ETH_CBSISQA) IdleSlope value for queue A Mask */
#define ETH_CBSISQA_ISA(value)                (ETH_CBSISQA_ISA_Msk & (_UINT32_(value) << ETH_CBSISQA_ISA_Pos)) /* Assigment of value for ISA in the ETH_CBSISQA register */
#define ETH_CBSISQA_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_CBSISQA) Register Mask  */


/* -------- ETH_CBSISQB : (ETH Offset: 0x14C4) (R/W 32) IdleSlope value for queue B -------- */
#define ETH_CBSISQB_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_CBSISQB) IdleSlope value for queue B  Reset Value */

#define ETH_CBSISQB_ISA_Pos                   _UINT32_(0)                                          /* (ETH_CBSISQB) IdleSlope value for queue A Position */
#define ETH_CBSISQB_ISA_Msk                   (_UINT32_(0xFFFFFFFF) << ETH_CBSISQB_ISA_Pos)        /* (ETH_CBSISQB) IdleSlope value for queue A Mask */
#define ETH_CBSISQB_ISA(value)                (ETH_CBSISQB_ISA_Msk & (_UINT32_(value) << ETH_CBSISQB_ISA_Pos)) /* Assigment of value for ISA in the ETH_CBSISQB register */
#define ETH_CBSISQB_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_CBSISQB) Register Mask  */


/* -------- ETH_UTXQBA : (ETH Offset: 0x14C8) (R/W 32) Upper 32 bits of transmit buffer descriptor queue base address -------- */
#define ETH_UTXQBA_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_UTXQBA) Upper 32 bits of transmit buffer descriptor queue base address  Reset Value */

#define ETH_UTXQBA_UTXQBA_Pos                 _UINT32_(0)                                          /* (ETH_UTXQBA) Upper 32 bits of transmit buffer descriptor queue base address Position */
#define ETH_UTXQBA_UTXQBA_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_UTXQBA_UTXQBA_Pos)      /* (ETH_UTXQBA) Upper 32 bits of transmit buffer descriptor queue base address Mask */
#define ETH_UTXQBA_UTXQBA(value)              (ETH_UTXQBA_UTXQBA_Msk & (_UINT32_(value) << ETH_UTXQBA_UTXQBA_Pos)) /* Assigment of value for UTXQBA in the ETH_UTXQBA register */
#define ETH_UTXQBA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_UTXQBA) Register Mask  */


/* -------- ETH_TXBDCTRL : (ETH Offset: 0x14CC) (R/W 32) TX BD control register -------- */
#define ETH_TXBDCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TXBDCTRL) TX BD control register  Reset Value */

#define ETH_TXBDCTRL_TXBDTSM_Pos              _UINT32_(4)                                          /* (ETH_TXBDCTRL) TX Descriptor Timestamp Insertion mode Position */
#define ETH_TXBDCTRL_TXBDTSM_Msk              (_UINT32_(0x3) << ETH_TXBDCTRL_TXBDTSM_Pos)          /* (ETH_TXBDCTRL) TX Descriptor Timestamp Insertion mode Mask */
#define ETH_TXBDCTRL_TXBDTSM(value)           (ETH_TXBDCTRL_TXBDTSM_Msk & (_UINT32_(value) << ETH_TXBDCTRL_TXBDTSM_Pos)) /* Assigment of value for TXBDTSM in the ETH_TXBDCTRL register */
#define ETH_TXBDCTRL_Msk                      _UINT32_(0x00000030)                                 /* (ETH_TXBDCTRL) Register Mask  */


